Revit 2027 API
TagMode Enumeration
 The modes of tag creation that are supported for IndependentTags.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TagMode
Public Enumeration TagMode
public enum class TagMode
type TagMode
Members
Member name | Value | Description
TM_ADDBY_CATEGORY | 0 |  Add a single category tag.
TM_ADDBY_MATERIAL | 2 |  Add a material tag.
TM_ADDBY_MULTICATEGORY | 1 |  Add a multi-category tag.
See Also
Reference
Autodesk.Revit.DB Namespace